---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledArea
source: html/02b42f72-06de-b50c-b542-943aef85958d.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledArea Property

The area of the extrusion, scaled to the units of export.

## Syntax (C#)
```csharp
public double ScaledArea { get; set; }
```